[{"lang":"en-US","siteName":"New York Post","link":"https://nypost.com/2024/03/07/us-news/grandma-of-elijah-vue-begs-court-to-keep-katrina-baur-in-jail/","title":"Grandma of missing boy Elijah Vue begs court to keep daughter behind bars because of 'history of erratic behavior'","byline":"Katherine Donlevy","excerpt":"The grandmother of a missing Wisconsin toddler begged a court to keep the boy’s mother — her daughter — locked behind bars, citing her “history of erratic behavior.”","textContent":"The grandmother of a missing Wisconsin toddler begged a court to keep the boy’s mother — her daughter — locked behind bars, citing her “history of erratic behavior.”\nThe desperate plea was delivered Thursday during a preliminary hearing for Katrina Baur, 31, who faces chronic child neglect charges in connection to 3-year-old Elijah Vue’s disappearance.\nThe boy vanished Feb. 20 after Baur sent him to the home of boyfriend Jesse Vang, who is also charged in the case, for “disciplinary reasons,” according to court documents.\nThere has been no trace of Elijah Vue since he was reported missing on Feb. 20. Two Rivers Police Department\nIn a statement read at the hearing, Jodi Baur asked that the court reject her daughter’s request to lower her $15,000 bond.\n“I have known Katrina Baur longer than anyone else as I am her mother,” said the statement, read aloud by District Attorney Jacalyn LaBre.\n“Katrina has struggled with depression and anxiety for many years, has a history of erratic behavior. She has been suffering from traumatic brain injury and is highly likely to forget mandatory appearances.” \n“I don’t feel it’s worth the risk to lower her bond, especially as a victim has not been found and many questions have not been answered. She does need to be held accountable for what rules out in the future and I feel releasing her she would be a flight risk.”\nJodi Baur also revealed that her daughter cut ties with her family in October 2022 following years of volatile behavior.\nKatrina Baur’s mother claimed she had a history of abuse and “erratic behavior.” Two Rivers Police Department\nJodi Baur claims she was a victim of Katrina Baur, who allegedly unleashed “verbal and emotional abuse” for years before their relationship dissolved.\nThe mistreatment was severe enough for Jodi Baur to ask that the court issue a no-contact order to Katrina Baur should she be released on bail.\nThe judge in the case, however, declined Katrina Baur’s plea to have her bond decreased — stating that the $15,000 cash amount was set “right where it needs to be.”\nKatrina Baur was arrested on Feb. 21, the day after Vang, 39, reported Elijah missing.\nJesse Vang was teaching the boy “how to be a man,” Katrina Baur allegedly told police. Two Rivers Police Department\nHe told police he had been taking a nap in the morning with Elijah in the bedroom, but awoke three hours later to find the boy gone.\nElijah had been staying at Vang’s Two Rivers home since Katrina Baur dropped him off on Feb. 12 so Vang could teach the boy “to be a man,” the mother told police, according to a criminal complaint.\nKatrina Baur — who was planning on picking up Elijah on Feb. 23 — was about 30 miles away when he vanished.\nShe was initially charged with child neglect, which has since been amended to chronic child neglect. \nKatrina Baur dropped Elijah at her boyfriend’s house a week earlier for “disciplinary reasons,” according to court documents. independent.co.uk\nShe also faces two misdemeanor counts of resisting or obstructing an officer.\nVang was charged with one felony count of party-to-a-crime child neglect and is being held on a $20,000 cash bond.\nInvestigators are still on the hunt for little Elijah, who is 3 feet tall, has dark blond hair and brown eyes, and weighs about 45 pounds.\nLocal police and the FBI are offering a combined total of $25,000 in rewards for information about the missing boy. Ross Auto Service\nA Manitowoc County Crime Stoppers reward for information leading to the location and return of Elijah or the arrest and conviction of those responsible for his disappearance has risen to as much as $10,000, Two Rivers Police Chief Ben Meinnert said in a news release.\nThe Crime Stoppers reward is in addition to an FBI reward of up to $15,000 in the case.","length":3921,"publishedTime":"2024-03-08T02:08:48Z","rating":[2,3,3,2,4,3,3],"reason":"The article receives a low score in Accuracy (2) as it lacks specific details about the case and fails to provide substantial evidence for the claims made. Objectivity scores poorly (3) due to the biased and emotional language used throughout the article. Clarity and Coherence is also rated low (3) because the information is presented in a disjointed and unorganized manner, making it difficult to follow. The Depth of Analysis dimension is rated low (2) as the article lacks in-depth examination of the case and the individuals involved. The Language and Presentation dimension scores a 4 due to some grammar issues and lack of proper formatting. Readability is rated a 3 because the article could be challenging for readers to comprehend the information easily. Lastly, the Attractive dimension scores a 3 as the article fails to engage the reader effectively and lacks a captivating writing style.","conclusion":0},{"lang":"en-MY","siteName":"thesun.my","link":"https://thesun.my/local_news/internal-auditors-should-adopt-agile-technology-driven-approach-to-remain-relevant-ag-GL12190611","title":"Internal auditors should adopt agile, technology-driven approach to remain relevant - AG","byline":"07-03- 2024 10:01 PM","excerpt":"KUALA LUMPUR: Internal auditors, particularly those in banking institutions, should embrace key transformations, such as adopting an agile, technology...","textContent":"KUALA LUMPUR: Internal auditors, particularly those in banking institutions, should embrace key transformations, such as adopting an agile, technology-driven and professional approach to remain relevant in the future, said Auditor-General Datuk Wan Suraya Wan Mohd Radzi. She said that with agility and a proactive approach, internal auditors could effectively address emerging risks, such as those associated with new technologies and evolving regulatory requirements. “Internal auditors must shift from solely relying on periodic audits to continuous auditing and monitoring. “By embracing a dynamic and proactive approach, internal audit functions can stay ahead of the curve and effectively mitigate risks,“ she said in her speech while officiating the inaugural Bank Audit Conference 2024 (BAC 2024), organised by the Asian Institute of Chartered Bankers (AICB) and AICB’s Chief Internal Auditors Networking Group (CIANG). On technology, Wan Suraya said artificial intelligence (AI), machine learning, and data analytics will revolutionise the way audits are conducted, and internal audit teams should leverage these tools to enhance efficiency, gain deeper insights, and perform more precise and targeted audits. “Automation will streamline processes, enhance accuracy, and provide deeper insights into risks and opportunities. By harnessing the power of technology, internal auditors will be able to identify emerging risks in real-time and proactively mitigate them,“ she said. Echoing Wan Suraya’s views, Asian Institute of Chartered Bankers (AICB) chairman Tan Sri Azman Hashim said that AI and data analytics could enable internal auditors to dive deeper into larger reams of data to understand what’s sustainably driving the business. He further emphasised that as internal auditors adopt new technologies, the ethical implications of AI and the integrity of their data sources also demand equal attention. He also highlighted that continuous learning is key for internal auditors to advance into the future and secure relevance in the profession. Azman added that AICB remains committed and continues to focus its efforts on upholding the highest standards of professional conduct and competence for the Malaysian banking workforce through its membership, qualifications, and continuous professional development programmes. Internal audit is the third line of defence Emphasising the crucial role of the internal audit function in organisations, HSBC independent non-executive director Datin Seri Sunita Mei-Lin Rajakumar said that non-executive directors, who are often the majority of board members, according to the best practices of corporate governance, require an unvarnished, independent view of the business. “Internal audit is the third line of defence that provides an independent view of a business’s internal controls and risks. As businesses become more complex, internal audits ensure that a company is well-maintained and on track,” she said during the press conference at BAC 2024. Meanwhile, CIANG chairman Shamsul Bahrom said that BAC 2024 discussed critical issues impacting internal auditors and promoted greater knowledge sharing and best practices. He said that one of the key takeaways from the discussion of the audit committee’s expectations is that internal auditors should maintain the highest level of independence, professionalism, objectivity, and thoroughness in executing their mandate, emphasising on the audit report. “As an internal auditor myself, I wish to emphasise the importance of acknowledging that the internal audit functions as the third line of defence and must always remain relevant and effective to protect stakeholders’ interests. It cannot be overemphasised that the internal audit function needs to evolve with the operating landscape. “The efforts by AICB and CIANG in preparing for the future will promote stronger compliance within our institutions, meet the highest international standards, and contribute to the stability of the financial system and the broader economy,” he said in his speech at the closing ceremony of BAC 2024. Additionally, Shamsul said that they (CIANG) had heard fruitful deliberations, moderations, and invaluable input from its esteemed speakers and panellists discussing the expectations of the internal audit function. “The chief executive officer (CEO)’s viewpoint underlines the critical role of internal audits as stewards of governance and risk management in promoting organisational resilience, creativity, and strategy alignment. “Their perspective acts as a guiding beacon, emphasising the necessity for agility, flexibility and foresight in internal auditors and, most importantly, for them to be knowledgeable and well-versed in understanding what they are auditing,” he added. Themed “Future of Internal Audit - Embracing Change, Staying Relevant”, BAC 2024 was organised by AICB and CIANG to provide a platform for internal audit professionals and experts to discuss the megatrends shaping the new audit and risk management landscape, regulatory developments, and how to elevate further the standards of internal audit practices in financial institutions in Malaysia. The two-day conference ending today featured over 30 bankers, regulators, and internal audit experts shedding light on the notable global trends in the industry, including digital disruption and cybersecurity, the increasing importance of environmental, social, and governance (ESG) issues in business coordination, and sustainability reporting. The conference drew over 500 delegates from local and international financial institutions and featured a pre-conference workshop that focused on integrating data security and cybersecurity into the internal audit framework. - Bernama","length":5758,"publishedTime":null,"rating":[8,7,8,7,9,8,7],"reason":"The article provides accurate information on the importance of internal auditors adopting an agile, technology-driven approach. It maintains objectivity by presenting the perspectives of various key figures in the industry without significant bias. The clarity and coherence of the article are well-maintained, with a structured organization that flows logically. The depth of analysis is commendable, discussing the implications of technology like AI and data analytics on internal audits. The language and presentation are of a high standard, with proper grammar and formatting. The readability is good, making the content easy to comprehend. While the article is informative, it could enhance its attractiveness by incorporating more engaging elements to captivate readers further.","conclusion":1},{"lang":"en-US","siteName":"The Mercury News","link":"https://www.mercurynews.com/2024/03/07/sf-giants-dodgers-rain-cuts-short-matt-chapmans-debut-kyle-harrisons-impressive-start/","title":"SF Giants-Dodgers: Rain cuts short Matt Chapman’s debut, Kyle Harrison’s impressive start","byline":"Evan Webeck","excerpt":"The Giants’ exhibition against the Dodgers was canceled in the top of the third because of rain.","textContent":"SCOTTSDALE, Ariz. — In the lineup Thursday night for the first time five days after his contract became official, Matt Chapman’s spring debut for the San Francisco Giants was cut short by the first rainout of Cactus League play.\nChapman took one at-bat, striking out looking on a fastball at the letters, and got his uniform dirty diving for a ball at third base.\nThe exhibition against the Dodgers was called in the top of the third with the game in a scoreless tie.\nKyle Harrison, the Giants starter, had struck out six of the first 10 batters he faced. But he issued two walks on eight consecutive pitches outside the strike zone and was clearly struggling to gain his footing on the mound as moisture continued to fall.\n“Whenever it gets like that, you’re going to be careful,” manager Bob Melvin said.\nThe first precipitation all spring also postponed the A’s exhibition earlier in the day, but the worst was thought to have passed by the time Harrison fired the first pitch against the Dodgers at 7:05 p.m. local time. However, rain continued to fall throughout, and the field was determined unplayable by the middle of the third inning.\t\t\t\t\nDespite the rainout, Harrison was able to get in the majority of the work he was scheduled for, throwing about 50 pitches of the 60 he planned to throw. The pitchers slated to follow him — Landen Roupp, Camilo Doval, Trevor McDonald, Hayden Birdsong and Spencer Bivens — will be pushed back.\nBefore the mound conditions deteriorated, Harrison’s fastball sat in the mid-90s, he landed sliders for strikes and, for the second straight outing, used his changeup as an effective third offering.\t\t\t\t\n“I’ve seen him a few times, but today — changeup, breaking ball, fastball — guys were having a tough time getting a good swing and (he was) using all his pitches,” Melvin said. “It’s the best I’ve seen him throw.”\nWith Chapman and fellow Gold Glove winner Nick Ahmed lined up behind him, Harrison was the first beneficiary of a potentially elite defensive infield.\nAfter he surrendered a double to Miguel Rojas, the Dodgers were threatening to score in the first inning when Teoscar Hernandez lined a ball into the hole between second and third. Chapman dove to his left, coming up empty, but Ahmed picked the ball ranging to his right, forcing Rojas to remain at third.\nHarrison recorded his second strikeout to end the inning unscathed, freezing James Outman with a 94-mph fastball on the outside corner.\n“You want to keep that ball on the infield so the run doesn’t score,” Melvin said. “In Chappy’s case, too, that’s maybe a ball he gets to sometimes. It’s gonna be a little bit before he gets his legs underneath him, but between the two of them it seems like we can cover some ground over there.”\nMany of the Giants’ top prospects will take on the best of the A’s farm system next Friday in a new twist to the spring schedule this year.\nThe rosters for the first annual “Spring Breakout” games were revealed Thursday, with Rayner Arias and Bryce Eldridge highlighting the Giants’ group.\nArias, 17, was one of the top international prospects when he signed out of the Dominican Republic in 2022, while the Giants drafted Eldridge 16th overall out of high school in last summer’s draft. Also slated to participate are shortstops Walker Martin, last year’s second-round selection, and Maui Ahuna, taken two rounds later.\nNot limited to only recent draftees, Hunter Bishop, Farhan Zaidi’s first first-round pick, is also scheduled to play after dealing with a string of injuries to begin his career.\nFirst pitch is scheduled for 4:05 p.m. next Friday, March 15, at Hohokam Stadium in Mesa, following the Giants’ Cactus League tilt against the A’s.\nThe list of tentative participants, in full: RHP Hayden Birdsong, RHP Josh Bostick, RHP Trevor McDonald, RHP Manuel Mercedes, RHP Mat Olsen, RHP Carson Ragsdale, RHP Landen Roupp, LHP Juan Sanchez, RHP Carson Seymour, LHP Joe Whitman, C Onil Perez, C Adrian Sugastey, SS Maui Ahuna, 1B Bryce Eldridge, SS Cole Foster, SS Walker Martin, SS/2B Diego Velasquez, OF Rayner Arias, OF/1B Victor Bericoto, OF Hunter Bishop, OF Vaun Brown, OF Jonah Cox, OF Grant McCray.\n— UTIL Blake Sabol will be sidelined for at least the next two weeks after straining his groin Tuesday against the Brewers. Sabol was attempting to beat out an infield single when he felt the muscle pull, and an MRI early Wednesday morning revealed the sprain — and cost Sabol a rare chance to sleep in.\n— RHP Sean Hjelle (elbow) also underwent imaging on his elbow, which revealed a sprain but no structural damage. While Hjelle said the timing was a tough blow, likely taking him out of the running to fill the fifth spot in the rotation, the outcome was the “best-case scenario” after feeling discomfort in his elbow in the days following his most recent outings.","length":4882,"publishedTime":"2024-03-08T02:59:04Z","rating":[7,5,8,6,7,7,6],"reason":"The article provides a detailed account of Matt Chapman's debut for the San Francisco Giants cut short by rain and Kyle Harrison's performance. It offers insight into the gameplay, including Chapman's at-bats and defensive efforts, alongside Harrison's pitching performance. The writing is clear and cohesive, allowing readers to follow the sequence of events effectively. While the article lacks in-depth analysis and could benefit from more in-depth insights into player strategies and game impact, it effectively conveys the key highlights of the match. The language used is engaging and informative, keeping the reader's interest throughout the article. The readability is good, ensuring that the audience can easily comprehend the information presented. Overall, the article is attractive with its storytelling style and vivid descriptions of the gameplay.","conclusion":1},{"lang":"en","siteName":"The SportsRush","link":"https://thesportsrush.com/f1-news-its-a-shame-george-russell-recalls-helpless-ordeal-as-ferrari-drivers-draw-first-blood/","title":"“It’s a Shame”: George Russell Recalls Helpless Ordeal as Ferrari Drivers Draw First Blood","byline":"Somin Bhattacharjee","excerpt":"George Russell came into the Bahrain GP with a lot of hope but was no match for the Ferrari duo of Carlos Sainz and Charles Leclerc","textContent":"George Russell started the Bahrain GP from P3 on the grid and was optimistic about a podium finish. Come the end of the race, he had to settle for P5, and he now looks back helplessly, as he analyzes just how slow the Mercedes was.\nRussell showed promise early on in the race but was soon overtaken by Sergio Perez. Then, Ferrari’s Carlos Sainz and Charles Leclerc passed him too, and there wasn’t much he could do about it. On the team radio, Russell and his race engineer were discussing problems related to engine overheating, which were visible in the other Mercedes-powered cars too. Nonetheless, Russell sees Bahrain as a missed opportunity for the team.\nIn the latest episode of the Chequered Flag podcast, he said, “It’s a shame that we didn’t get to show any of the real potential of this car. So it’s been a bit of a strange day.”\nRussell’s words stemmed from the fact that Mercedes entered the Bahrain GP with great hope. They were strong in pre-season testing and practice ahead of the race too. Unfortunately, for Russell, the Ferrari cars were too fast. Hamilton meanwhile, couldn’t make too many places either. To him, engine issues were not the only problem.\nAfter Lewis Hamilton qualified in P9 in Bahrain, he revealed that he sacrificed qualifying pace for better performance in the long runs. However, that did not work out too well for the seven-time world champion. The only drivers he managed to get the better of were McLaren’s Oscar Piastri and Aston Martin’s Fernando Alonso.\nAdmittedly, Alonso and Piastri were not driving the fastest of cars. He passed Alonso fairly easily and was on a better strategy than Piastri who put him in front. However, he couldn’t do anything to threaten Lando Norris, or anyone ahead of him.\nAs quoted by the BBC, Hamilton said, “I think there is a feeling of disappointment within the team. “I thought we would have been better today than we were. It was a close race, degradation was high.”\nThe only positives Hamilton can see going into the next few races is the fact that his car is reliable. Both him and Russell will be hoping for some major developments by Mercedes if they are to be competitive at some point this season.","length":2251,"publishedTime":null,"rating":[7,8,7,6,8,7,6],"reason":"The article provides accurate information on George Russell and Lewis Hamilton's performance at the Bahrain GP, detailing their struggles during the race. It maintains objectivity by reporting facts without significant bias. The clarity and coherence of the article are good, with a clear structure and organization of events. However, the depth of analysis could be improved by delving more into the technical aspects of the cars' performance issues. The language and presentation are well done, with proper grammar and formatting. The readability is good, making it easy for readers to comprehend the content. While the article is informative, it lacks a more engaging and captivating writing style, affecting its attractiveness to a wider audience.","conclusion":1},{"lang":"en","siteName":"Peoplemag","link":"https://people.com/alicia-keys-shares-photos-son-egypt-13th-birthday-8361850","title":"Alicia Keys Shares Sweet Throwback Photos for Son Egypt's 13th Birthday: 'This Can't Be Real'","byline":"Georgia Slater","excerpt":"Alicia Keys celebrated son Egypt's 13th birthday on Sunday with a heartfelt Instagram post. The singer shares sons Egypt and Genesis, 8, with husband Swizz Beatz.","textContent":"\"You are a dream come true,\" Alicia Keys wrote of her newly-minted teen\nThe \"Girl on Fire\" singer, 42, celebrated son Egypt's 13th birthday on Sunday, sharing a series of photos throughout her son's life alongside a heartfelt message on Instagram.\n\"This can’t be real!! You can’t be 13!!!! You are a dream come true!!\" she began.\n\"May the most high protect you!! and may you always walk like the young king you are 👑👑👑 I’m so proud of you, my son!! 🌞🌞🌞You light up the world!!! Happy Born Day!!!!! To happiness, love, blessings and many many more!! 💥💥💥💥💥.\"\nKeys shares sons Egypt and Genesis, 8, with Swizz Beatz, who also shared an Instagram birthday tribute to the newly-minted teen.\nNever miss a story — sign up for PEOPLE's free daily newsletter to stay up-to-date on the best of what PEOPLE has to offer, from juicy celebrity news to compelling human interest stories. \n\"Happy Birthday Egypt the Big 13 wow🥳 We love you and wish you many blessings 🙏🏽,\" wrote the record producer alongside various photos of Egypt.\n\"This crazy world needs your positive love and energy 🤍🤍🤍 Look at how big you are now it’s happening tooooooooooo fast almost 6ft💆🏾‍♂️🤌🏾😮‍💨🤍🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳🥳,\" he concluded.\nBeatz, who also is dad to three children from previous relationships, Prince Nasir, Kasseem Jr. and Nicole, also praised Keys for her role as a mom in the comments of her Instagram.\nOver the years, Keys has been very vocal about the different facets of motherhood.\n\"Motherhood, I find, makes you look at yourself in a way that is a mirror like no other that you've been presented with before,\" she told PEOPLE at the 2019 American Express and Billboard Women in Music Impact Brunch in Los Angeles. \"I think it makes you look at what you have taken or learned from other people and how that becomes your truth, whether it's yours or not.\"","length":2141,"publishedTime":null,"rating":[5,4,6,3,7,8,7],"reason":"The article provides factually accurate information about Alicia Keys celebrating her son Egypt's 13th birthday with a series of throwback photos and heartfelt messages. However, the article lacks objectivity as it mainly focuses on Alicia Keys' personal experiences and emotions rather than providing a balanced perspective. The clarity of the article is decent, but the depth of analysis is superficial, primarily consisting of a recap of Alicia Keys' Instagram posts. The language and presentation are good with no major grammar or spelling issues, but the depth of analysis could be improved. The readability is quite high due to the simple language and straightforward storytelling, making it easy for readers to comprehend. The article's attractiveness is moderate, with some engaging elements like Alicia Keys' emotional expressions, but it lacks compelling storytelling or in-depth analysis to truly captivate readers.","conclusion":1},{"lang":null,"siteName":"BNN","link":"https://www.bnnbloomberg.ca/crabby-business-n-l-fisheries-worker-charged-with-accepting-pans-of-crab-as-bribe-1.1996454","title":"Crabby business: N.L. fisheries worker charged with accepting 'pans of crab' as bribe - BNN Bloomberg","byline":null,"excerpt":"A federal Fisheries Department employee in Newfoundland and Labrador is accused of accepting bribes of seafood.","textContent":"The information you requested is not available at this time, please check back again soon.\n Loblaw’s comments on the grocery code of conduct and risks for affordability\n A federal Fisheries Department employee in Newfoundland and Labrador is accused of accepting bribes of seafood.\nScott Fortune, 32, has been charged with forgery, falsifying documents, accepting bribes and two counts of fraud.\nDocuments from the provincial court in Stephenville, N.L., alleged that Fortune was bribed with \"pans of crab\" to help fishers hide the true amount of crab they had harvested.\nHe is accused of falsifying the actual weight of the harvested seafood and forging a document.\nThe charge sheet says the alleged offences took place between January 2021 and June of this year.\nNone of the allegations have been proven in court, and Fisheries and Oceans Canada did not immediately respond to a request for comment.\nThis report by The Canadian Press was first published Nov. 9, 2023.","length":2849,"publishedTime":"2023-11-09T13:03:48-05:00","rating":[5,7,6,5,6,6,5],"reason":"The article provides factual information regarding the charges laid against Scott Fortune, a federal Fisheries Department employee in Newfoundland and Labrador, for accepting bribes in the form of seafood. The details of the alleged offenses and the timeline of events are clearly presented. However, the article lacks depth of analysis and does not delve into broader implications or investigative context. The language and presentation are adequate, with no glaring issues in grammar or formatting. The writing style is objective and informative, with a balanced perspective on the events described. While the article is coherent and fairly readable, it could benefit from more engaging elements to captivate the reader's interest.","conclusion":1},{"lang":"en","siteName":"Medical Xpress","link":"https://medicalxpress.com/news/2024-03-personalized-musculoskeletal-diversity-body.html","title":"Developing personalized musculoskeletal models that reflect the diversity of body types","byline":"Science X","excerpt":"People do not always move optimally, which can lead to physical complaints. This can have many causes, from a cruciate ligament injury in the knee to mobility problems after a stroke. Musculoskeletal models could be used to assess people with suboptimal movement patterns. These models simulate the function of muscles, and the load on bones and joints to better understand movement. This can help with rehabilitation, for example by learning to use the muscles differently.","textContent":"People do not always move optimally, which can lead to physical complaints. This can have many causes, from a cruciate ligament injury in the knee to mobility problems after a stroke. Musculoskeletal models could be used to assess people with suboptimal movement patterns. These models simulate the function of muscles, and the load on bones and joints to better understand movement. This can help with rehabilitation, for example by learning to use the muscles differently.\n However, musculoskeletal models in research are now based on the body of an average male. Scientists from TU Delft, Department of Mechanical Engineering, investigate how accurate these models are for a broad population. The one-size-fits-all approach could hinder proper treatment by doctors and physiotherapists. The researchers are therefore working on personalized musculoskeletal models based on a simple 3D scan.\nIn an ideal world, you would have a fully personalized model of each individual. In medical practice, this is not feasible. The process is time-consuming, expensive, and requires an MRI scan. Therefore, a standard model is used and then scaled as accurately as possible to an individual's body shape. Research by Ph.D. candidate Judith Cueto Fernandez and Eline Van der Kruk, assistant professor of Biomechanical Engineering, shows how inaccurate this can be. \"If you compare the existing approach with a fully personalized model, you see deviations of 15% to 20%,\" says Van der Kruk.\nYou don't need to have an exceptional or unusual build for this: Existing musculoskeletal models also fall short for women. Why is that? The standard model is based on the skeleton of an average man. This deviation can become problematic when you base treatments on this model. \"Imagine you are recovering from a cruciate ligament injury and have an asymmetrical load on your knees,\" says Cueto Fernandez. \"In that case, this asymmetry could go unnoticed, or overestimated. In that case, you cannot accurately measure the effect of a treatment.\"\nThere is not yet a generic model for women, but for the researchers, it's about much more. \"Ideally, you have a model that matches your physique as closely as possible, but that is currently not the case for men and women,\" says Van der Kruk.\nWhy is it that the generic models are only based on an average man? \"Globally, only 28% of engineering graduates are women and because the research topics are chosen personally, you naturally get more male-dominated topics,\" she explains.\n\"You also see that the research participants are more often male. They are often recruited at technical universities themselves, where there are simply more male students. There are also more male researchers and they sometimes find it an uncomfortable idea to have a woman in a sports bra in their lab. So this type of practical reasons can play a role.\"\nThe researchers are now working on more representative models. Participants in the study receive a full-body MRI scan and their movements are monitored in the lab. The goal of the project is to make it easier to generate personalized musculoskeletal models. At the same time the research shows the limitations of using the \"generic model.\" The researchers are training algorithms to estimate the shape of the skeleton and muscle properties based on body shape. Van der Kruk says, \"The ultimate goal is that in the future, with a 3D scan of a few seconds, you can create a personalized model.\"\nThis would mean that a doctor or physiotherapist could easily create a model themselves to better treat the patient, without the need for an MRI scan. According to Van der Kruk, this is becoming increasingly urgent. \"With the rapid development of AI-based movement analyses, you can now even register movements with an app on your phone. But this software is based on existing models and is therefore not reliable enough to assess what is happening inside the body and thus does not do justice to the diversity of bodies and varying movement patterns among people.\"\nThe clear link with medical practice is precisely why Cueto Fernandez finds her Ph.D. research so satisfying. \"It is very easy to see the practical application. We are not working on an abstract concept that might make a difference in 20 years. If things speed up a bit, this technology could improve medical practice.\"\n Developing personalized musculoskeletal models that reflect the diversity of body types (2024, March 7)\n This document is subject to copyright. Apart from any fair dealing for the purpose of private study or research, no\n part may be reproduced without the written permission. The content is provided for information purposes only.","length":6617,"publishedTime":"2024-03-07T13:34:03-05:00","rating":[8,9,8,7,8,8,7],"reason":[{"Accuracy":"The article provides accurate information about the use of musculoskeletal models in assessing movement patterns, the limitations of current models based on the average male body, and the efforts to develop personalized models for a diverse population."},{"Objectivity":"The article presents a balanced perspective on the topic without significant bias, providing insights from researchers and the challenges faced in developing personalized musculoskeletal models."},{"Clarity and Coherence":"The article is well-structured, clearly explaining the current issues with generic musculoskeletal models and the research efforts to create personalized models based on individual body shapes."},{"Depth of Analysis":"The article delves into the problems with generic musculoskeletal models, the impact on treatment outcomes, and the ongoing research to improve model accuracy."},{"Language and Presentation":"The language used is professional and technical, maintaining a high standard of grammar and spelling throughout the article."},{"Readability":"The article is written in a clear and coherent manner, making the complex topic of musculoskeletal models accessible to a wider audience."},{"Attractive":"The article engages readers by highlighting the relevance of personalized models in medical practice and the potential impact on improving treatment outcomes."}],"conclusion":1},{"lang":"en-GB","siteName":"Nikkei Asia","link":"https://asia.nikkei.com/Business/Markets/Property/China-can-t-simply-let-crisis-hit-developers-fail-economic-adviser","title":"China can't simply let crisis-hit developers fail: economic adviser","byline":"Staff Writer","excerpt":"Yin Yanlin cites lack of alternatives to real estate's contribution to GDP","textContent":"ArrowArtboardCreated with Sketch.ArtboardCreated with Sketch.Title ChevronTitle ChevronIcon Mail ContactPath LayerPositive ArrowPropertyYin Yanlin cites lack of alternatives to real estate's contribution to GDP The real estate sector \"contributes nearly a third of gross domestic product,\" says Yin Yanlin, a senior economic advisor for the Chinese government. \nMarch 8, 2024 03:16 JST | ChinaBEIJING -- China's struggling real estate companies \"can't be allowed to fail lightly,\" a senior economic member of China's top political advisory body said, underscoring concern about a potentially tumultuous economic hard landing.Yin Yanlin, vice chairman of the economics committee of the Chinese People's Political Consultative Conference, discussed the real estate woes while speaking to media outlets including Nikkei on Wednesday. The body is meeting in Beijing alongside the National People's Congress.Read Next\n Nikkei Asian Review, now known as Nikkei Asia, will be the voice of the Asian Century.","length":1321,"publishedTime":"2024-03-07T18:16:24+00:00","rating":[3,5,7,4,6,5,3],"reason":"The article scores low in Accuracy (3) due to lack of detailed information and sources to support the claims made by Yin Yanlin. Objectivity is rated mediocre (5) as there is a lack of counter perspective presented in the article, potentially leading to bias. While the Clarity and Coherence dimension is relatively good (7), the Depth of Analysis falls short (4) as the article lacks in-depth exploration of the topic. Language and Presentation are acceptable (6), though improvements could be made in providing more engaging language. Readability (5) is fair but could be enhanced for better comprehension. The article lacks in being Attractive (3) as it fails to engage the reader with captivating elements like vivid descriptions or storytelling.","conclusion":0},{"lang":"en","siteName":"MLB","link":"https://www.mlb.com/news/brewers-spring-breakout-roster-2024","title":"Here's the Brewers' Spring Breakout roster","byline":"David Adler","excerpt":"The Brewers will have one of the most loaded teams in the Spring Breakout.\nLed by MLB's No. 2 overall prospect, 19-year-old outfield phenom Jackson Chourio, Milwaukee's roster for the upcoming showcase is stacked on both the hitting and pitching side.\nSo it's only fitting that they play the Spring","textContent":"March 7th, 2024The Brewers will have one of the most loaded teams in the Spring Breakout.Led by MLB's No. 2 overall prospect, 19-year-old outfield phenom Jackson Chourio, Milwaukee's roster for the upcoming showcase is stacked on both the hitting and pitching side.So it's only fitting that they play the Spring Breakout's grand finale for the Cactus League: Sunday, March 17 against the Royals at 3:05 p.m. CT at Surprise Stadium.\"I know it’s going to be something exciting and fun, and we’re going to get to enjoy it the most we can,\" Chourio said. \"Playing with those future stars makes me really happy. To have the opportunity to talk to them more and get to know each other better is good.\"\"I am really excited for the game that is coming up,\" Quero said. \"I am going to play my best and cherish that experience.\"Chourio will be one of the marquee players of the entire Spring Breakout competition. MLB's Big Three top prospects are all participating: No. 1 prospect Jackson Holliday, Chourio and No. 3 prospect Paul Skenes.Chourio's finally starting to heat up at Spring Training, too, and it couldn't come at a better time: leading into the Spring Breakout showcase and, potentially, Opening Day.Starting with Chourio, Milwaukee has nine of its top 10 prospects on the Spring Breakout roster -- the only one not playing is infielder Joey Ortiz -- and 24 of the team's Top 30 for 2024.That's tied for the most Top 30 prospects that any team will have in the Spring Breakout. The other team with 24? Kansas City, the Brewers' opponent.Milwaukee manager Pat Murphy is excited for the game.\"I hope it goes well,\" Murphy said. \"I hope they get a lot of people there.\"The Brewers' last four first-round Draft picks who are still prospects will all be on the team: third baseman Brock Wilken (the No. 18 overall pick in 2023), right-hander Josh Knoth (also picked in 2023 at No. 33 overall), shortstop Eric Brown Jr. (No. 27 overall in 2022) and Black (No. 33 overall in 2021).Of that group, Wilken especially has been tearing it up this spring -- the 21-year-old slugger is batting .714 (5-for-7) in Cactus League play and has reached base in nine of his 11 plate appearances.With their stuff -- Misiorowski with his triple-digit fastball and Gasser with his big sweeping slider -- those two will be pitchers to watch if they get into the game. So will others like Carlos Rodriguez, the organization's two-time Minor League Pitcher of the Year.Here's everything else you need to know about the Brewers' Spring Breakout.How to tune in: MLB Digital (MLB.TV, MLB.com, MLB App), GamedayWhat is Spring Breakout? MLB Spring Breakout is a four-day event showcasing baseball’s future: the current stars of Minor League Baseball. The inaugural edition will be held from March 14-17 at Grapefruit and Cactus league stadiums during Spring Training. A series of 16 exhibition games will be played between teams comprised of each MLB organization’s top prospects, creating a new touchpoint on the baseball calendar that celebrates our sport’s budding talent.Here's the Brewers' Spring Breakout roster with MLB Pipeline's rankings:PITCHERSJacob Misiorowski, RHP, No. 2 (MLB No. 33)Robert Gasser, LHP, No. 6Carlos Rodriguez, RHP, No. 8Josh Knoth, RHP, No. 13Logan Henderson, RHP, No. 17Bradley Blalock, RHP, No. 18Bishop Letson, RHP, No. 27Patricio Aquino, RHP, No. 29Shane Smith, RHP, NRJustin Yeager, RHP, NRCATCHERJeferson Quero, C, No. 3 (MLB No. 35)INFIELDERSTyler Black, 3B, No. 4 (MLB No. 46)Brock Wilken, 3B, No. 7Cooper Pratt, SS, No. 10Eric Brown Jr., SS, No. 12Eric Bitonti, 3B, No. 14Mike Boeve, 3B, No. 15Luke Adams, 3B, No. 16Daniel Guilarte, SS, No. 20Juan Baez, SS, No. 24Wes Clarke, 1B, No. 25OUTFIELDERSJackson Chourio, OF, No. 1 (MLB No. 2)Luis Lara, OF, No. 9Yophery Rodriguez, OF, No. 11Dylan O'Rae, OF, No. 21","length":3817,"publishedTime":"2024-03-07T19:50:00Z","rating":[5,6,7,4,6,6,5],"reason":"The article provides a detailed overview of the Brewers' Spring Breakout roster, highlighting key players and prospects included in the lineup. The information presented is accurate in terms of player rankings and upcoming events. However, the article leans more towards promotional content rather than an objective analysis, lacking in-depth analysis and critical perspectives on the players and team. The structure and organization are clear, making it easy to follow the list of players and their rankings. The language used is engaging and appropriate for the subject matter, with no significant issues in readability. Overall, the article serves as a concise introduction to the Brewers' Spring Breakout roster, but it lacks a deeper analysis and could benefit from a more balanced presentation.","conclusion":1},{"lang":"en-GB","siteName":"BBC News","link":"https://www.bbc.co.uk/news/uk-england-merseyside-68506053","title":"Liverpool: Police object to care firm running bar linked to stabbings","byline":"By David Humphreys","excerpt":"Police say the decision could mean the existing licence holder would stay involved in the bar.","textContent":"Image source, PA MediaImage caption, The Safe House can appeal against the decision within 21 daysPolice have raised objections to a care company taking over the running of a bar linked to a brawl in which a young boxer was stabbed.Anthony Dodson was seriously injured after a large fight outside The Safe House bar in Liverpool on 27 December. The council voted to revoke the bar's licence but a bid was made to transfer it to a Manchester-based care firm.Merseyside Police said it feared if that were granted the existing licence holder would remain involved.Alongside Mr Dodson, three other men also suffered serious injuries, including a 21-year-old who was stabbed in the back and a 23-year-old who suffered lacerations to his head after being struck with a glass or bottle.A 20-year-old man was later traced who had also suffered lacerations to the head.Seven men have been charged to date over the incident. Liverpool Council moved quickly to suspend the premises' licence before moving to revoking it entirely, subject to an appeal. Image source, PA MediaImage caption, Four men were hurt in the disorder, with one man critically injuredA three-person panel at Liverpool Town Hall in January agreed to remove the business' permission to sell alcohol after hearing evidence from police and owner Meshach Harris. However, the bid was made to transfer the licence to the Manchester-based company Right-Step Ltd the day before the crunch hearing. Police have objected to that move, with a fresh panel to be held next week, the Local Democracy Reporting Service said. Licensing Constable Nicola Ireland raised concerns regarding the transfer to Right-Step Ltd. In a written submission, she said such a move would undermine licensing objectives of prevention of crime and disorder and questioned the role of Mr Harris in a new operation, which would mean \"no material change to the operation\".PC Ireland added that there was \"no indication\" Right-Step Ltd had experience in running a licenced city centre premises, \"which was a contributory factor in the failures of the previous premises licence holder.\" Mr Harris' licensing agent Karl Barry said his client did not have to explain why the licence was being transferred and had done so immediately before the initial hearing in January.Why not follow BBC Merseyside on Facebook, X and Instagram? You canMore on this storyRelated Internet LinksThe BBC is not responsible for the content of external sites.","length":2459,"publishedTime":"2024-03-07T17:39:31.000Z","rating":[3,4,5,2,6,4,3],"reason":"The article provides details surrounding a brawl at The Safe House in Liverpool, focusing on the objections raised by the police regarding a care firm taking over the running of the bar. The information presented seems factually accurate regarding the incident and the objections raised by Merseyside Police, providing a clear account of the events. However, the article lacks depth of analysis, offering limited insight into the broader implications or context of the situation. The language and presentation are acceptable, but readability is somewhat hindered by the abundance of specific details without a cohesive narrative flow. The article lacks an engaging writing style, missing opportunities to draw readers in with compelling storytelling or vivid descriptions.","conclusion":0}]